package homeworkone;

public class HomeWork1Task1 {
    public static void main(String[] args) {
        int a = 42;
        int b = 15;
        System.out.print("42 & 15 = " + (a & b) + "; "); // 42 =00101010, 15=00001111, Результат 10 = 00001010
        System.out.print("42 | 15 = " + (a | b) + "; "); // 42 =00101010, 15=00001111, Результат 47 = 00101111
        System.out.print("42 ^ 15 = " + (a ^ b) + "; "); // 42 =00101010, 15=00001111, Результат 37 = 00100101
        System.out.print("42 ~ = " + ~a + "; ");// 42 =00101010, Результат -43=11010101
        System.out.print("15 ~ = " + ~b + "; ");// 15=00001111, Результат -16=11110000
        System.out.print("42 << 1 = " + (a << 1) + "; "); // 42 =00101010, Результат 84=01010100
        System.out.print("15 << 1 = " + (b << 1) + "; "); // 15=00001111, Результат 30=00011110
        System.out.print("42 >> 1 = " + (a >> 1) + "; "); // 42 =00101010, Результат 21=00010101
        System.out.print("15 >> 1 = " + (b >> 1) + "; "); // 15=00001111, Результат 7=00000111
        System.out.print("42 >>> 1 = " + (a >>> 1) + "; ");// 42 =00101010, Результат 21=00010101
        System.out.println("15 >>> 1 = " + (b >>> 1) + "; "); // 15=00001111, Результат 7=00000111
        System.out.print("42 &= 15 = " + (a &= b) + "; ");//42 =00101010, 15=00001111, Результат a=10 = 00001010
        a = 42;
        System.out.print("42 |= 15 = " + (a |= b) + "; "); // 42 =00101010, 15=00001111, Результат a=47 = 00101111
        a = 42;
        System.out.print("42 ^= 15 = " + (a ^= b) + "; "); // 42 =00101010, 15=00001111, Результат a=37 = 00100101
        a = 42;
        System.out.print("42 <<= 1 = " + (a <<= 1) + "; "); // 42 =00101010, Результат a=84=01010100;
        System.out.print("15 <<= 1 = " + (b <<= 1) + "; "); // 15=00001111, Результат b=30=00011110
        a = 42;
        b = 15;
        System.out.print("42 >>= 1 = " + (a >>= 1) + "; "); // 42 =00101010, Результат a=21=00010101
        System.out.print("15 >>= 1 = " + (b >>= 1) + "; "); // 15=00001111, Результат b=7=00000111
        a = 42;
        b = 15;
        System.out.print("42 >>>= 1 = " + (a >>>= 1) + "; ");// 42 =00101010, Результат a=21=00010101
        System.out.println("15 >>>= 1 = " + (b >>>= 1)); // 15=00001111, Результат b=7=00000111
        System.out.println('\n');
        int c = -42;
        int d = -15;
        System.out.print("-42 & -15 = " + (c & d) + "; "); // -42 =11010110, -15=11110001, Результат -48 = 11010000
        System.out.print("-42 | -15 = " + (c | d) + "; "); // -42 =11010110, -15=11110001, Результат -9 = 11110111
        System.out.print("-42 ^ -15 = " + (c ^ d) + "; "); // -42 =11010110, -15=11110001, Результат 39 = 00100111
        System.out.print("-42 ~ = " + ~c + "; ");// -42 =11010110, Результат 41 = 00101001
        System.out.print("-15 ~ = " + ~d + "; ");// -15=11110001, Результат 14 = 00001110
        System.out.print("-42 << 1 = " + (c << 1) + "; "); // -42 =11010110, Результат -84 = 10101100
        System.out.print("-15 << 1 = " + (d << 1) + "; "); // -15=11110001, Результат -30 = 11100010
        System.out.print("-42 >> 1 = " + (c >> 1) + "; "); // -42 =11010110, Результат -21 = 11101011
        System.out.print("-15 >> 1 = " + (d >> 1) + "; "); // -15=11110001, Результат -8 = 11111000
        System.out.println("-42 >>> 28 = " + (c >>> 28) + "; ");// -42 =11010110, Результат 15 = 0000111
        System.out.print("-15 >>> 28 = " + (d >>> 28) + "; "); // -15=11110001, Результат 15 = 0000111
        System.out.print("-42 &= -15 = " + (c &= d) + "; ");//-42 =11010110, -15=11110001, Результат c=-48 = 11010000
        c = -42;
        System.out.print("-42 |= -15 = " + (c |= d) + "; "); // -42 =11010110, -15=11110001, Результат c=-9 = 11110111
        c = -42;
        System.out.print("-42 ^= -15 = " + (c ^= d) + "; "); // -42 =11010110, -15=11110001, Результат c=39 = 00100111
        c = -42;
        System.out.print("-42 <<= 1 = " + (c <<= 1) + "; "); // -42 =11010110, Результат c=-84 = 10101100
        System.out.print("-15 <<= 1 = " + (d <<= 1) + "; "); // -15=11110001, Результат d=-30 = 11100010
        c = -42;
        d = -15;
        System.out.print("-42 >>= 1 = " + (c >>= 1) + "; "); // -42 =11010110, Результат c=-21 = 11101011
        System.out.print("-15 >>= 1 = " + (d >>= 1) + "; "); // -15=11110001, Результат d=-8 = 11111000
        c = -42;
        d = -15;
        System.out.print("-42 >>>= 28 = " + (c >>>= 28) + "; ");// -42 =11010110, Результат c=15 = 0000111
        System.out.println("-15 >>>= 28 = " + (d >>>= 28)); // -15=11110001, Результат d=15 = 0000111
    }
}
